In [2]:
print('Introduction to pandas')

Introduction to pandas

Key Data Structures in Pandas
1. Series
2. DataFrame

In [8]:
import pandas as pd

In [14]:
index = ['a','b','c','d']
s= pd.Series([1,2,3,4],index=index)

In [15]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
df = pd.DataFrame({"Name":['shivam','Rohan','Raghav','Madhav'],"Age":[23,35,56,43]},index=index)

In [23]:
df

     Name  Age
a  shivam   23
b   Rohan   35
c  Raghav   56
d  Madhav   43

In [24]:
df1 = pd.read_csv('salary.csv')

In [26]:
df1.head()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [27]:
df.describe()

             Age
count   4.000000
mean   39.250000
std    13.865425
min    23.000000
25%    32.000000
50%    39.000000
75%    46.250000
max    56.000000

In [31]:
type(df1['year'])

pandas.core.series.Series

In [35]:
df1[['year','unit']]

       year               unit
0      2011              COUNT
1      2011              COUNT
2      2011  DOLLARS(millions)
3      2011  DOLLARS(millions)
4      2011  DOLLARS(millions)
...     ...                ...
20119  2023  DOLLARS(millions)
20120  2023  DOLLARS(millions)
20121  2023  DOLLARS(millions)
20122  2023  DOLLARS(millions)
20123  2023  DOLLARS(millions)

[20124 rows x 2 columns]

In [38]:
# first row of the df1
df1.iloc[0]

year                                                 2011
industry_code_ANZSIC                                    A
industry_name_ANZSIC    Agriculture, Forestry and Fishing
rme_size_grp                                          a_0
variable                                    Activity unit
value                                               46134
unit                                                COUNT
Name: 0, dtype: object

In [41]:
df1.isnull().sum()

year                    0
industry_code_ANZSIC    0
industry_name_ANZSIC    0
rme_size_grp            0
variable                0
value                   0
unit                    0
dtype: int64

In [42]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [24, 27, 22, 32, 29],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Salary": [55000, 48000, 52000, 58000, 60000],
    "Experience (Years)": [2, 3, 1, 8, 5],
    "Department": ["HR", "Finance", "IT", "Marketing", "Sales"]
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City  Salary  Experience (Years) Department
0    Alice   24     New York   55000                   2         HR
1      Bob   27  Los Angeles   48000                   3    Finance
2  Charlie   22      Chicago   52000                   1         IT
3    David   32      Houston   58000                   8  Marketing
4      Eva   29      Phoenix   60000                   5      Sales

In [43]:
# Question 1:
# Display the first two rows of the DataFrame.

df.head(2)

    Name  Age         City  Salary  Experience (Years) Department
0  Alice   24     New York   55000                   2         HR
1    Bob   27  Los Angeles   48000                   3    Finance

In [45]:
# Question 2:
# How would you display only the "Name" and "Salary" columns for all rows in the DataFrame?

df[['Name',"Salary"]]

      Name  Salary
0    Alice   55000
1      Bob   48000
2  Charlie   52000
3    David   58000
4      Eva   60000

In [49]:
# Filter the DataFrame to show only rows where the "Age" is greater than 25.

df[df['Age'] > 25]

    Name  Age         City  Salary  Experience (Years) Department
1    Bob   27  Los Angeles   48000                   3    Finance
3  David   32      Houston   58000                   8  Marketing
4    Eva   29      Phoenix   60000                   5      Sales

In [50]:
# Find the average salary of employees in the DataFrame.

df['Salary'].mean()

np.float64(54600.0)

In [ ]:
# add a new column, "Bonus," where the bonus is 10% of the salary for each employee?